README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>README</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-07-11 15:12:48 EDT"/>
<meta name="author" content="Greg"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">README</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 k. </a>
<ul>
<li><a href="#sec-1.1">1.1 Appendix A: Summary of Notations </a>
<ul>
<li><a href="#sec-1.1.1">1.1.1 Predicate Calculus </a></li>
<li><a href="#sec-1.1.2">1.1.2 Conceptual Graphs </a></li>
<li><a href="#sec-1.1.3">1.1.3 Knowledge Interchange Format </a></li>
</ul>
</li>
<li><a href="#sec-1.2">1.2 Appendix B: Sample Ontology </a>
<ul>
<li><a href="#sec-1.2.1">1.2.1 Principles of Ontology </a></li>
<li><a href="#sec-1.2.2">1.2.2 Top-Level Categories </a></li>
<li><a href="#sec-1.2.3">1.2.3 Role and Relation Types </a></li>
<li><a href="#sec-1.2.4">1.2.4 Thematic Roles </a></li>
<li><a href="#sec-1.2.5">1.2.5 Placement of Thematic Roles </a></li>
</ul>
</li>
<li><a href="#sec-1.3">1.3 Extended Examples </a>
<ul>
<li><a href="#sec-1.3.1">1.3.1 Hotel Reservation System </a></li>
<li><a href="#sec-1.3.2">1.3.2 Library Database </a></li>
<li><a href="#sec-1.3.3">1.3.3 ACE Vocabulary </a></li>
<li><a href="#sec-1.3.4">1.3.4 Translating ACE to Logic </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> k. </h2>
<div class="outline-text-2" id="text-1">

<p>This repository is a collection of code related to <b>Knowledge Representation</b>.
</p>
<p>
A great overview (54 pages) of Knowledge Representation can be
found in the three appendices of John Sowa's <i>Knowledge Representation.</i>
</p>

</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Appendix A: Summary of Notations </h3>
<div class="outline-text-3" id="text-1.1">


</div>

<div id="outline-container-1.1.1" class="outline-4">
<h4 id="sec-1.1.1"><span class="section-number-4">1.1.1</span> Predicate Calculus </h4>
<div class="outline-text-4" id="text-1.1.1">

<ul>
<li id="sec-1.1.1.1">Predicates <br/>
</li>
<li id="sec-1.1.1.2">Predicate Logic <br/>
</li>
<li id="sec-1.1.1.3">Formation Rules <br/>
</li>
<li id="sec-1.1.1.4">Rules of Inference <br/>
</li>
<li id="sec-1.1.1.5">Rules for Quantifiers <br/>
</li>
<li id="sec-1.1.1.6">Typed Predicate Logic <br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-1.1.2" class="outline-4">
<h4 id="sec-1.1.2"><span class="section-number-4">1.1.2</span> Conceptual Graphs </h4>
<div class="outline-text-4" id="text-1.1.2">

<ul>
<li id="sec-1.1.2.1">Definition A.2.1: Conceptual Graph <br/>
</li>
<li id="sec-1.1.2.2">Definition A.2.2: Concept <br/>
</li>
<li id="sec-1.1.2.3">Definition A.2.3: Conceptual Relation <br/>
</li>
<li id="sec-1.1.2.4">Definition A.2.4: Lambda Expression <br/>
</li>
<li id="sec-1.1.2.5">Definition A.2.5: Concept Type <br/>
</li>
<li id="sec-1.1.2.6">Definition A.2.6: Relation Type <br/>
</li>
<li id="sec-1.1.2.7">Definition A.2.7: Referent <br/>
</li>
<li id="sec-1.1.2.8">Definition A.2.8: Context <br/>
</li>
<li id="sec-1.1.2.9">Definition A.2.9: Coreference Set <br/>
</li>
<li id="sec-1.1.2.10">Definition A.2.10: Knowledge Base <br/>
</li>
<li id="sec-1.1.2.11">Transformation Rules <br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-1.1.3" class="outline-4">
<h4 id="sec-1.1.3"><span class="section-number-4">1.1.3</span> Knowledge Interchange Format </h4>
<div class="outline-text-4" id="text-1.1.3">


</div>
</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Appendix B: Sample Ontology </h3>
<div class="outline-text-3" id="text-1.2">


</div>

<div id="outline-container-1.2.1" class="outline-4">
<h4 id="sec-1.2.1"><span class="section-number-4">1.2.1</span> Principles of Ontology </h4>
<div class="outline-text-4" id="text-1.2.1">

<ul>
<li id="sec-1.2.1.1">Glossary <br/>
<ul>
<li>
alignment
</li>
<li>
axiomatized ontology
</li>
<li>
differentiae
</li>
<li>
hierarchy
</li>
<li>
identity conditions
</li>
<li>
integration
</li>
<li>
knowledge base
</li>
<li>
lexicon
</li>
<li>
mixed ontology
</li>
<li>
partial compatibility
</li>
<li>
primitive
</li>
<li>
prototype-based ontology
</li>
<li>
Quine's criterion
</li>
<li>
refinement
</li>
<li>
semantic factoring
</li>
<li>
terminological ontology
</li>
<li>
unification
</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-1.2.2" class="outline-4">
<h4 id="sec-1.2.2"><span class="section-number-4">1.2.2</span> Top-Level Categories </h4>
<div class="outline-text-4" id="text-1.2.2">

</div>

</div>

<div id="outline-container-1.2.3" class="outline-4">
<h4 id="sec-1.2.3"><span class="section-number-4">1.2.3</span> Role and Relation Types </h4>
<div class="outline-text-4" id="text-1.2.3">

</div>

</div>

<div id="outline-container-1.2.4" class="outline-4">
<h4 id="sec-1.2.4"><span class="section-number-4">1.2.4</span> Thematic Roles </h4>
<div class="outline-text-4" id="text-1.2.4">

</div>

</div>

<div id="outline-container-1.2.5" class="outline-4">
<h4 id="sec-1.2.5"><span class="section-number-4">1.2.5</span> Placement of Thematic Roles </h4>
<div class="outline-text-4" id="text-1.2.5">

</div>
</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3"><span class="section-number-3">1.3</span> Extended Examples </h3>
<div class="outline-text-3" id="text-1.3">


</div>

<div id="outline-container-1.3.1" class="outline-4">
<h4 id="sec-1.3.1"><span class="section-number-4">1.3.1</span> Hotel Reservation System </h4>
<div class="outline-text-4" id="text-1.3.1">

</div>

</div>

<div id="outline-container-1.3.2" class="outline-4">
<h4 id="sec-1.3.2"><span class="section-number-4">1.3.2</span> Library Database </h4>
<div class="outline-text-4" id="text-1.3.2">

</div>

</div>

<div id="outline-container-1.3.3" class="outline-4">
<h4 id="sec-1.3.3"><span class="section-number-4">1.3.3</span> ACE Vocabulary </h4>
<div class="outline-text-4" id="text-1.3.3">

</div>

</div>

<div id="outline-container-1.3.4" class="outline-4">
<h4 id="sec-1.3.4"><span class="section-number-4">1.3.4</span> Translating ACE to Logic </h4>
<div class="outline-text-4" id="text-1.3.4">

</div>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Greg
<a href="mailto:greg@greg-Satellite-C855D">&lt;greg@greg-Satellite-C855D&gt;</a>
</p>
<p class="date"> Date: 2013-07-11 15:12:48 EDT</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
